<template>
  <div>
    <!-- 标题 -->
    <div v-if="tableData.name === '问答题'">
      <span>示例:如何理解肾主水？</span>
      <span>答：肾主水，主要是只肾中精气的气化功能，对于体内津液的输布、排泄，维持体内津液代谢的平衡，起着极为重要的调节作用，所以《素问·逆调论》称“肾者水脏，主津液”。</span>
    </div>
    <div v-if="tableData.name === '判断题'">
      <span>中医认识治疗疾病，着眼于辨证而不辨病</span>&nbsp;&nbsp;&nbsp;
      <span>答：( X )</span>
    </div>
    <div v-if="tableData.name === '填空题'">
      <span> 中医学包括 (中医基础理论  、  中医预防医学  、  中医临床医学 )  三部分。</span>&nbsp;&nbsp;&nbsp;
    </div>
    <div v-if="tableData.name === '单选题'">
      <span>治疗下痢，属“通因通用”法的方剂是 </span>&nbsp;&nbsp;&nbsp;
      <span>答案：D </span>
      <p>A.葛根黄芩黄连汤</p>
      <p>B.大承气汤</p>
      <p>C.白头翁汤</p>
      <p>D.芍药汤</p>
    </div>
    <div v-if="tableData.name === '多选题'">
      <span>秋冬气候寒凉，人体在生理上可反映为： </span>&nbsp;&nbsp;&nbsp;
      <span>答案：(DE) </span>
      <p>A.江南地区，人体腠理多稀疏</p>
      <p>B.北方地区，人体腠理多致密</p>
      <p>C.阴盛则寒</p>
      <p>D.皮肤致密，少汗多尿</p>
    </div>
    <div v-if="tableData.name === 'X题型'">
      <span>秋冬气候寒凉，人体在生理上可反映为： </span>&nbsp;&nbsp;&nbsp;
      <span>答案：(DE) </span>
      <p>A.江南地区，人体腠理多稀疏</p>
      <p>B.北方地区，人体腠理多致密</p>
      <p>C.阴盛则寒</p>
      <p>D.皮肤致密，少汗多尿</p>
    </div>
    <div v-if="tableData.name === '西医临床题'">
      <span>（一）体格检查样题  </span>
      <p>
        请完成以下体格检查项目
        351．用水银血压计测量血压，报告测量结果。
        2．检查脑膜刺激征，报告检查结果；逐一口述各项检查的正常表现及
        阳性表现。
      </p>
      <p>答案与评分要点:</p>
      <p>1.测量血压</p>
      <p>
        （1）检查前准备
        ①器具准备：选择汞柱式（台式）血压计、戴好听诊器。
        ②体位：简要说明检查目的，要求被检查者采取相应体位（坐位或卧
        位）。
      </p>
      <p>
        （2）检查方法
        ①打开血压计水银柱开关，检查血压计水银柱上端是否在血压计刻度
        “0”点，嘱被检查者裸露右上臂，伸开并轻度外展、手掌向上。保持血压
        计水银柱“0”点、被检查者肘部与其心脏在同一水平（卧位时右手臂外展
        45°，平腋中线）
        ②将血压计袖带紧贴被检查者皮肤缠于其右上臂，松紧度适宜，袖带
        下缘距肘横纹上 2cm～3cm；在袖带下缘附近触诊被检查者肱动脉搏动位置，
        将听诊器体件置于肱动脉搏动处。
        ③向袖带内充气，边充气边听诊，至肱动脉搏动音消失后，继续充气
        致水银柱再升高 30mmHg，然后缓慢放气（水银柱下降速度约为 2～6mmHg/
        秒），同时双眼平视水银柱，根据听诊动脉搏动音变化对应的水银柱位置，
        记录收缩压、舒张压数值。
        ④挤压出袖带内的气体，血压计水银柱归“0”，重复测量第二次。
        （1）检查结果：（考生口述）报告两次测压的平均值，先报收缩压，
        后报舒张压，并报出血压计量单位。
        2.脑膜刺激征检查
        （1）检查前准备
        ①向被检者简要说明检查项目，要求被检者配合检查，并及时告知检
        查中的不适与疼痛。
        ②协助被检者取去枕仰卧位，双下肢伸直。
        36 （2）检查方法
        ①颈强直：检查者右手轻轻按在被检者胸前，左手置于被检查者枕部，
        托扶头部并作屈颈动作，测试其颈肌抵抗程度。
        ②凯尔尼格征：嘱被检查者将一侧下肢抬起，检查者以左手固定被检
        查者右侧（或左侧）膝关节，右手托持于被检查者右侧（或左侧）足跟部，
        使髋、膝关节均呈 90°，继续抬高下肢使之伸膝达 135°以上，体会有无
        抵抗感并确定被检查者有无疼痛。
        ③布鲁津斯基征：检查者右手轻按被检查者胸前，左手托扶被检者枕
        部并作屈颈动作，观察被检查者髋、膝关节有无屈曲动作。
        （3）检查结果
        ①报告检查结果：脑膜刺激征阴性。
        ②口述上述三项检查的阳性表现：
        颈强直阳性表现为被动屈颈时抵抗力增强。
        凯尔尼格征阳性表现为伸膝受阻伴有疼痛或下肢屈肌牵拉痉挛。
        布鲁津斯基征阳性表现为双侧膝关节和髋关节屈曲。
      </p>
      <p>（二）西医操作样题 </p>
      <p>
        黄某，男，49 岁。劳累后出现乏力、纳差 6 月余，伴活动后气急、憋
        气 20 余天，自感腹胀、腹部膨隆日渐明显，腹围显著增大，每日尿量约
        500ml。有慢性乙型肝炎病史 10 余年。入院后行腹部 B 超检查示肝脏缩小，
        回声增强，大量腹水。
      </p>
      <p>
        答题要求：为进一步诊疗，请为该患者行腹腔穿刺术，并回答考官提
        问。
      </p>
      <p>答案与评分要点： </p>
      <p>一、操作前准备 </p>
      <div>
        <p>
          1．操作前向患者简要说明操作过程与目的，消除顾虑和紧张情绪，让
          患者排尽尿液。排尿后取仰卧位，用软尺测量患者腹围。
        </p>
        <p>
          2．准备并检查腹腔穿刺包、试管及盛放腹水的容器、医用胶带等。
        </p>
        <p>
          3．嘱患者背靠椅背上；不能坐位者，可半卧或平卧位，稍向左侧倾斜。
          374．标记穿刺进针点：应以叩诊浊音区为准。坐位时穿刺点选择在脐与
          左侧髂前上棘连线的中、外 1/3 交界处，或脐与耻骨联合连线中点上方 1cm
          的左或右侧 1.5cm 处；卧位穿刺点在脐水平线与腋前线相交处。
        </p>
      </div>
      <p>二、操作过程 </p>
      <div>
        <p>
          1．常规消毒穿刺点周围皮肤，戴无菌手套，铺消毒洞巾。逐层麻醉穿
          刺点皮肤及皮下组织。
        </p>
        <p>
          2．术者左手固定穿刺部位皮肤，右手持腹腔穿刺套管针从麻醉处刺入
          腹壁，当穿刺针阻力突然消失时，表示针已进入腹腔，然后松开穿刺针连
          接的橡胶管夹子，放出积液，留取适量积液送检，记录抽液量。
        </p>
        <p>
          3．操作中注意观察患者的呼吸、脉搏、面色等，发现异常应立即停止
          操作，并做相应处理。
        </p>
        <p>
          4．操作完成后，拔出穿刺针，覆盖无菌纱布，稍用力压迫穿刺部位片
          刻后，用胶布固定纱布。
        </p>
        <p> 5.操作后医疗垃圾处置合理。</p>
        <p>
          6．（考官提问）如果该患者抽取腹水较多，应如何处理？答案：大量
          放腹水者，需用多头腹带加压穿刺部位，以防腹压骤降，内脏血管扩张引
          起休克。
        </p>
        <p>7.考生仪容整洁、仪态大方、语言动作规范，表现出良好的职业素质。</p>
        <p>（三）西医答辩样题 </p>
        <p>
          患者，女，68 岁。10 年前开始间断出现反酸、烧心，饱餐后明显，自
          服“法莫替丁”有效，未系统诊治。近半年上述症状加重，时有胸部疼痛
          及进食哽噎感，口服“硝酸甘油”无效，遂就诊。无肿瘤史及家族病史。
          查体未见异常，血、尿、粪常规检查及肝肾功能检查均未见异常。
        </p>
        <p>答题要求：为确诊，该患者需进一步作的检查有哪些？ </p>
        <p>答案与评分要点：</p>
        <div>
          <p>1.胃镜检查。</p>
          <p>2.血脂、血糖、心肌酶谱、肿瘤标志物</p>
          <p>3.心电图、超声心动图、X 线胸片、冠状动脉造影。 </p>
          <p>4.食管 pH 检测和食管压力测定。 </p>
          <p>5.上消化道 X 线钡剂造影检查。 </p>
        </div>
        <p>（四）辅助检查结果判读分析样题 </p>
        <p>
          李某，女，50 岁。平素时有胸闷，心悸不适，心电图检查结果如下，
          请作出心电图诊断，并回答考官提问。
        </p>
        <p>答案与评分要点： </p>
        <p>
          <img
            src="../../../assets/images/xdt.png"
            style="width:500px;height:200px"
            alt=""
          >
        </p>
        <p>
          1．心电图诊断：一度房室传导阻滞。
        </p>
        <p>
          2．考官提问：此处略。每道试题均有不同问题，考官根据实际提问即
          可。
        </p>
      </div>
    </div>
    <div v-if="tableData.name === '中医临证题'">
      <p>示例：</p>
      <p>（一）中医操作样题 </p>
      <div class="question1">
        <p>
          1．中医操作样题：诊查被检者（3 岁以内小儿）指纹，叙述并演示操
          作方法，汇报诊查结果并说明其指纹特征及临床意义。
        </p>
        <p>答案与评分要点： </p>
        <p>1.操作方法 </p>
        <p>
          （1）考生诊察小儿指纹时，嘱家长抱小儿面向光亮处，使受检者手臂
          与心脏处于同一水平。
        </p>
        <p>
          （2）考生用左手（或一手）拇指和食指握住小儿食指末端，再以右手
          （或另一手）拇指在小儿食指掌侧前缘从指尖向指根部推擦几次，即从命
          关向气关、风关直推。
        </p>
        <p>（3）考生检查时用力适中，使指纹显露，便于观察。 </p>
        <p>
          （4）观察内容全面：络脉显现部位的深浅（浮沉）及所在食指的位置，
          络脉的形状（络脉支数的多少、络脉的粗细等）、色泽（红、紫、青、黑）
          及淡滞（浅淡、浓滞）。
        </p>
        <p>2.诊查结果 </p>
        <p>（1）指纹特征 </p>
        <p>考生诊查结果与考官判别结果一致则满分，部分一致可得某分。</p>
        <p>（2）临床意义 </p>
        <p>
          考生指纹判别结果与考官判别结果不同，但叙述其临床意义准确可得某
          分。
        </p>
        <p>3.职业素养 </p>
        <p>
          诊查过程中能够对被检者进行安抚，避免被检者产生恐惧感，影响检查
          效果
        </p>
      </div>
      <div class="question2">
        <p>
          2．中医操作样题:女性患者，32 岁。感受风寒后出现咳嗽 2 天。拟取
          合谷、风门施治。
        </p>
        <p>
          答题要求：叙述合谷、风门定位，并在被检者身上取穴；在模具上行
          针管进针法刺风门穴，并回答考官提问。
        </p>
        <p>答案与评分要点： </p>
        <p>合谷：在手背，第 2 掌骨桡侧的中点处。 </p>
        <p>
          风门：在脊柱区，第 2 胸椎棘突下，后正中线旁开 1.5 寸。
          针管进针法操作：
        </p>
        <p>1．选择适当规格的无菌毫针、套管。</p>
        <p>2．选择适宜体位，充分暴露针刺部位。 </p>
        <p>3．术者双手、针刺部位皮肤常规消毒。</p>
        <p>
          4．将无菌毫针插入针管内，针尖与针管下端平齐，置于风门穴处，针
          管上端露出针柄 3 分左右。押手持针管，用刺手食指叩打或用中指弹击针
          尾，使针刺入皮肤内，退出针管，再将针刺入穴位。
        </p>
        <p>5．出针，合理处置医疗废弃物。</p>
        <p>
          6．考生仪容整洁、仪态大方、语言动作规范，表现出良好的职业素质。
          （考官提问）如你在行针过程中，患者出现了恶心、汗出、面色白，
          你首先应考虑是什么情况？该如何处理？
          答案：晕针。应立即停止针刺，将针全部起出，将患者平仰卧，头部
          放低，给饮温开水或糖水。随时问询和关注患者状态，有其他情况发生时
          再作进一步处理。
        </p>
      </div>
      <div class="question3">
        <p>
          3．中医操作样题：女性患者，中上腹部冷痛 1 周。拟在中脘、神阙行
          温灸器灸法治疗。
        </p>
        <p>
          答题要求：叙述中脘、神阙定位，并在被检者身上取穴；在模具上行
          温灸器灸法操作，并回答考官提问。
        </p>
        <p>答案与评分要点： </p>
        <p>中脘：在上腹部，脐中上 4 寸，前正中线上。 </p>
        <p>神阙：在脐区，脐中央。</p>
        <p>温灸器灸法操作： </p>
        <p>
          1．选择温灸器具、艾条、火柴或打火机等操作用具；嘱患者仰卧，暴
          露腹部（或施术部位）。
        </p>
        <p>2．点燃合适长度的艾条，装入温灸器。 </p>
        <p>3．将温灸器置于腧穴或应灸部位。 </p>
        <p>4．艾条燃烧数分钟后，观察施灸部位有无红晕。 </p>
        <p>（考官提问）一般灸多久？答案：一般 10～15 分钟移灸其他穴位。</p>
        <p>
          5．操作完毕，用镊子取出艾条，采用合适方法熄灭艾条（如浸水法、
          32 套帽法），并说明如何防止艾条复燃。
        </p>
      </div>
      <div class="question4">
        <p>
          4．中医操作样题：男性患者，34 岁。发热 1 天。请于大椎穴行刺血
          拔罐法操作。
        </p>
        <p>
          答题要求：叙述大椎穴定位，并在被检者身上取穴；在模具上行刺血
          拔罐法操作，并回答考官提问。
        </p>
        <p>答案与评分要点： </p>
        <p>大椎：在脊柱区，第 7 颈椎棘突下凹陷中，后正中线上。 </p>
        <p>刺血拔罐法操作： </p>
        <p>
          1．选择大小适宜的火罐、95%酒精棉球、三棱针或粗毫针或皮肤针、
          镊子、点火用具等。
        </p>
        <p>
          2．嘱患者选择合适体位（坐位或俯卧位），并暴露施术部位，查看局
          部皮肤有无皮损。
        </p>
        <p>
          3．术者双手、针刺部位皮肤常规消毒，用消毒后的三棱针或粗毫针等
          点刺或皮肤针叩刺出血。
        </p>
        <p>4．再在出血部位拔罐、留罐。  </p>
        <p>5．（考官提问）留罐多长时间？答案：一般 10～15 分钟。  </p>
        <p>
          6．术毕，起罐，用无菌干棉球或棉签擦净拔罐部位，罐具清理，消毒
          处理。
        </p>
      </div>
      <div class="question5">
        <p>
          5．中医操作样题：男性患者，44 岁。背腰部疼痛 1 月余，拟于腰背
          部行掌擦法治疗。
        </p>
        <p>
          答题要求：在模具上行擦法操作，并回答考官提问。
        </p>
        <p>答案与评分要点： </p>
        <p>
          1．向受术者介绍治疗项目，指导受术者摆放体位（俯卧位或坐位），
          暴露背部，涂少许润滑介质。
        </p>
        <p>
          2．术者选取合适站姿，以全掌附着于受术者背部，腕关节伸直，使前
          臂与手掌基本相平，以肘关节为支点，前臂做主动屈伸运动。手掌在背腰
          部做直线往返摩擦移动，用力均匀、压力适中，动作可先缓慢、后加快。
          （考官提问）擦法操作合适的频率和时间是多少？答案：频率一般为
          100～120 次/分。每次治疗时间不可过长，以治疗部位发热或受术者感觉
          33温热为度，以免造成皮肤损伤。
        </p>
        <p>
          3.治疗结束，用餐巾纸或毛巾擦拭背腰部润滑介质，告知受术者，协
          助受术者起身，告知注意事项。
        </p>
        <p>
          （二）病史采集
        </p>
        <p>
          患者刘某，男，55 岁。全身水肿伴胸闷、泛恶 2 周。
        </p>
        <p>答题要求：围绕主诉，采集现病史及相关病史。  </p>
        <p>答案与评分要点：   </p>
        <p>
          （一）现病史
        </p>
        <p>1.根据主诉及相关鉴别问诊</p>
        <p>
          （1）起病的诱因及发病缓急。发病前是否有外感水湿、饮食不节等诱
          因。
        </p>
        <p>（2）针对水肿（主症） </p>
        <p>
          水肿的起始部位，按之凹陷是否即起，与体位变化、活动量的关系，
          有无尿少。
        </p>
        <p>（3）相关鉴别诊断的问诊 </p>
        <p>1）有无恶寒、发热，肢节酸楚等。 </p>
        <p>2）有无烦热口渴、皮肤疮疡等。 </p>
        <p>3）有无有无腰酸冷痛、畏寒肢冷、水肿反复消长。 </p>
        <p>2.诊治经过 </p>
        <p>
          （1）发病以来是否曾到医院就诊，有无做过相关检查：血、尿、便常
          规、血压、肾功能及生化检查等。
        </p>
        <p>（2）是否用过药物治疗。如是否用过利水消肿药物等，效果如何。</p>
        <p>3.发病以来一般情况问诊，如精神、饮食、睡眠情况等。 </p>
        <p>（二）相关病史 </p>
        <p>（1）既往疾病史，有无心悸等病史</p>
        <p>（2）有无药物、食物过敏史。 </p>
        <p>（3）家族史。</p>
        <p>3.考官判断：问诊顺序合理，条理清晰，体现了中医临床思维。 </p>
      </div>
      <div class="question5">
        <p>
          6．中医操作样题：患者涕中带血 2 天，咳嗽，自觉鼻燥咽干，诊为鼻衄，为肺经风热所致。
          针刺治疗该患者应选取的主穴和配穴是什么？ 回答考官其他问题。
        </p>
        <p>答案与评分要点： </p>
        <p>
          主穴：迎香、上星、天府、孔最。
        </p>
        <p>
          配穴：鱼际、少商。
        </p>
        <p>
          （考官提问）迎香穴、少商穴的主治分别有哪些？
        </p>
        <p>
          迎香：
        </p>
        <p>
          ①鼻塞、鼽衄等鼻病；
        </p>
        <p>②口歪、面痒等口面部病证； 。  </p>
        <p>③胆道蛔虫症。    </p>
        <p>
          少商：
        </p>
        <p>①咽喉肿痛、鼻衄、高热等肺系实热病证； </p>
        <p>
          ②昏迷、癫狂等急症。
        </p>
        <p>
          2．患者胸部膨满，胸膺满闷，短气喘息，稍劳即著，咳嗽痰多，色白
          黏腻，畏风易汗，脘痞纳少，倦怠乏力，舌质暗，苔薄腻，脉滑。试述该
          患者病证诊断、治法和代表方剂。
        </p>
        <p>
          答案与评分要点：
        </p>
        <p>1．病证诊断：肺胀，痰浊壅肺证 </p>
        <p>2．治法：化痰降气，健脾益肺。 </p>
        <p>3．代表方剂：苏子降气汤合三子养亲汤加减。  </p>
        <p>3．外感风寒者，其脉多浮紧。试述浮脉的脉象特征和紧脉的临床意义。 </p>
        <p>答案与评分要点： </p>
        <p>
          浮脉：轻取即得，重按稍减而不空，举之有余，按之不足。
        </p>
        <p>紧脉：多见于实寒证、疼痛、食积等。 </p>
      </div>
    </div>
    <div v-if="tableData.name === '病案分析题'">
      <span>示例：周某，男，53岁，已婚，职员。2019年10月12日初诊。 </span>
      <p>患者长期素食，且饮食量少，近半月来出现头昏眼花，动则加剧，劳累即发，伴神疲乏力，倦怠懒言，纳少腹胀，舌质淡，苔薄白，脉细弱。 </p>
      <p>请与中风相鉴别</p>
      <p>【正确答案】 参考答题要点：</p>
      <p>中医疾病诊断：眩晕</p>
      <p>中医证型诊断：气血亏虚证</p>
      <p>中医辨病辩证依据（含病因病机）：</p>
      <p>以头昏眼花为主症，四诊合参，诊断为眩晕。</p>
      <p>心悸少寐，神疲乏力，倦怠懒言，纳少腹胀，舌质淡，苔薄白，脉细弱，辨证为气血亏虚证。</p>
      <p>由于年高体衰，气血亏虚，清阳不展，脑失所养而引发本病。</p>
      <p>中医类证鉴别：</p>
      <p>相同点：中风与眩晕都可能会有昏倒的症状。</p>
      <p>不同点：中风以卒然昏仆，不省人事，伴有口舌歪斜，半身不遂，失语；或不经昏仆，以口舌歪斜和半身不遂为特征。中风昏仆与眩晕之仆倒相似，且眩晕多为中风先兆，但眩晕患者无半身不遂、昏仆不省人事、口舌歪斜及舌强语蹇等表现。也有部分中风病人，以眩晕、头痛为其先兆表现，故临证当注意中风与眩晕的区别与联系。</p>
      <p>中医治法：补益气血，调养心脾</p>
      <p>代表方剂：归脾汤加减</p>
      <p>药物组成、剂量及煎服方法：</p>
      <p>党参15g、白术12g、黄芪12g、当归12g</p>
      <p>熟地12g、龙眼肉9g、大枣9g、茯苓9g</p>
      <p>炒扁豆6g、远志6g、枣仁6g</p>
      <p>三剂，水煎服。日一剂，早晚分服。</p>
    </div>
    <div v-if="tableData.name === 'T题型'">
      <p>示例：第一幕</p>
      <p>王某，男，30岁。3天前患者因起居不慎出现双眼睑浮肿，伴恶寒发热，体温37.2-37.5℃。就诊于门诊，检查尿常规：蛋白2+，潜血-；肝、肾功能无异常；血压120/75mmHg，自诉半年前单位体检尿常规：蛋白1+，未系统诊治。刻诊：患者双眼睑浮肿，咽喉红肿疼痛，24小时尿量1000mL，大便正常，舌红苔薄黄，脉浮滑数。</p>
      <p>1.依据患者目前临床表现及化验，首先考虑的诊断是（单选题）</p>
      <p>A.水肿；急性肾小球肾炎</p>
      <p>B.水肿；慢性肾小球肾炎</p>
      <p>C.感冒；急性肾小球肾炎</p>
      <p>D.感冒；慢性肾小球肾炎</p>
      <p>E.发热；急性肾盂肾炎</p>
      <p>【答案：B】</p>
      <p>2.患者的临床表现属于《金匮要略·水气病》中类型是（单选题）</p>
      <p>A.风水</p>
      <p>B.皮水</p>
      <p>C.石水</p>
      <p>D.正水</p>
      <p>E.黄汗</p>
      <p>【答案：A】</p>
      <p>3.患者眼睑浮肿，结合《内经》所论水肿病的主要病因是（单选题）</p>
      <p>A.风邪袭表</p>
      <p>B.疮毒内犯</p>
      <p>C.外感水湿</p>
      <p>D.五脏阳竭</p>
      <p>E.饮食不节</p>
      <p>【答案：A】</p>
      <p>4.依据患者临床表现及舌脉，下列中药最适宜的方药是（单选题）</p>
      <p>A.茯苓、泽泻、猪苓、白术、桂枝</p>
      <p>B.麻黄、生石膏、白术、生姜、大枣、甘草</p>
      <p>C.麻黄、连翘、杏仁、赤小豆、大枣、生姜、甘草</p>
      <p>D.桑白皮、陈皮、大腹皮、茯苓皮、生姜皮</p>
      <p>E.苍术、厚朴、陈皮、甘草、桂枝、白术、茯苓</p>
      <p>【答案：B】</p>
      <p>第二幕</p>
      <p>
        患者经中医药治疗1周后，热退，咽喉红肿好转，双眼睑浮肿消退，未再复查尿常规。半年后患者因劳累再次出现眼睑浮肿，并伴双下肢轻度水肿，无恶寒发热，起初未予重视，迁延2月后患者双下肢水肿进行性加重延及腰骶部，就诊于门诊查尿常规：蛋白3+，潜血-；血肌酐179umo/L，血尿素12mmol/L，血清白蛋白28g/L，双肾彩超：双肾大小正常，实质回声稍增强。并建议住院治疗。
        刻诊：腰以下重度水肿，腰酸冷痛，四肢厥冷，神疲乏力，面色㿠白，时有心悸胸闷，夜间间断有喘息难卧，腹大胀满，24小时尿量500-700mL，大便不畅。
      </p>
      <p>5.依据患者目前的临床表现，下列选项中最符合患者的舌像及脉像是（单选题）</p>
      <p>A.舌质淡红苔黄，脉弦滑</p>
      <p>B.舌质淡红苔白，脉弦缓</p>
      <p>C.舌质淡胖苔白，脉沉细涩</p>
      <p>D.舌质淡胖苔白，脉沉迟无力</p>
      <p>E.舌质红苔黄，脉濡数</p>
      <p>【答案：D】</p>
      <p>6.依据患者当前临床症状及舌脉表现，下列辨证分型中最适宜的是（单选题）</p>
      <p>A.阳水；水湿浸渍</p>
      <p>B.阳水；湿热壅盛</p>
      <p>C.阴水；脾阳虚衰</p>
      <p>D.阴水；肾阳衰微</p>
      <p>E.阴水；瘀水互结</p>
      <p>【答案：D】</p>
      <p>7. 依据患者当前临床症状，如表现为咳喘面浮，汗多，不能平卧，下列最适宜加用的药物是（单选题）</p>
      <p>A.黄芪、附子、肉桂、巴戟天、炙甘草、干姜</p>
      <p>B.瓜蒌、浙贝母、鱼腥草、黄芩、蒲公英、桔梗</p>
      <p>C.石韦、冬瓜仁、生薏米、鲜芦根、桃仁、丹参</p>
      <p>D.麻黄、桂枝、干姜、细辛、五味子、白芍</p>
      <p>E.党参、蛤蚧、五味子、山茱萸、煅牡蛎、黑锡丹</p>
      <p>【答案：E】</p>
      <p>8.依据患者病史及临床表现，在辨证论治的基础上，临床上常合用的药物是（单选题）</p>
      <p>A.茯苓、猪苓、泽泻</p>
      <p>B.桃仁、红花、赤芍</p>
      <p>C.生黄芪、党参、白术</p>
      <p>D.金银花、连翘、蒲公英</p>
      <p>E.麻黄、杏仁、葶苈子</p>
      <p>【答案：B】</p>
      <p>第三幕</p>
      <p>患者住院期间查24小时尿蛋白定量7.2g，血清白蛋白24g/L，血肌酐140μmol/L，血尿素8.1mmol/L，否认传染病史。行肾活检穿刺术，病理诊断：膜性肾病II期。西医以糖皮质激素联合环孢霉素A控制蛋白尿等。病情稳定后患者门诊复诊，规律撤减糖皮质激素及环孢霉素A，病情尚稳定。出院2月后门诊复诊，复查尿常规：蛋白2+，24小时尿蛋白定量1.3g，血清白蛋白37g/L，肾功能正常。复诊时症状：双下肢轻度水肿，劳累后腰部疼痛，渴不欲饮，纳可，寐安，24小时尿量1200-1500ml，大便调，舌紫暗苔白，脉沉细涩。</p>
      <p>9.治疗方案运用糖皮质激素及环孢霉素A，可能会引起血糖升高、股骨头坏死、消化道溃疡等较多不良后果，作为医生应该做的是（单选题）</p>
      <p>A.拒绝该患者使用此治疗药物</p>
      <p>B.积极向患者推荐本治疗药物</p>
      <p>C.向患者讲明该治疗药物的疗效和副作用，并由患者自己选择</p>
      <p>D.告知患者家属，并由其家属说服患者使用该药物</p>
      <p>E.悄悄给患者使用该药物，并事后告知患者</p>
      <p>【答案：C】</p>
      <p>10.该患者在住院期间如果出现了肺部感染，以下抗生素中不适宜使用的药物是（单选题）</p>
      <p>A.依替米星</p>
      <p>B.莫西沙星</p>
      <p>C.头孢曲松</p>
      <p>D.哌拉西林</p>
      <p>E.美罗培南</p>
      <p>【答案：A】</p>
      <p>11. 依据患者此次门诊复诊临床症状及舌脉表现，下列中医治法最适宜的是（单选题）</p>
      <p>A.宣肺解毒，通阳利水</p>
      <p>B.运脾化湿，通阳利水</p>
      <p>C.健脾温阳，化气行水</p>
      <p>D.活血祛瘀，化气行水</p>
      <p>E.温肾助阳，化气行水</p>
      <p>【答案：D】</p>
      <p>12.患者在规律使用糖皮质激素及环孢霉素A过程中，手臂皮肤出现了疖肿溃烂，病情反复，表现为眼睑浮肿延及全身，皮肤光亮，恶风发热，舌质红，苔薄黄，脉滑数，下列最适宜的方药是（单选题）</p>
      <p>A.五皮饮合胃苓汤 </p>
      <p>B.麻黄连翘赤小豆汤合五味消毒饮</p>
      <p>C.真武汤合济生肾气丸  </p>
      <p>D.桃红四物汤合五苓散</p>
      <p>E.实脾饮合疏凿饮子</p>
      <p>【答案：B】</p>
    </div>
    <div v-if="tableData.name === 'D题型'">
      <span>秋冬气候寒凉，人体在生理上可反映为： </span>&nbsp;&nbsp;&nbsp;
      <span>答案：(DE) </span>
      <p>A.江南地区，人体腠理多稀疏</p>
      <p>B.北方地区，人体腠理多致密</p>
      <p>C.阴盛则寒</p>
      <p>D.皮肤致密，少汗多尿</p>
    </div>
    <div v-if="tableData.name === 'B1题型'">
      <p>示例：</p>
      <p>A.午后发热</p>
      <p>B.傍晚发热</p>
      <p>C.潮热骨蒸</p>
      <p>D.身热夜甚</p>
      <p>E.夜热早凉</p>
      <p>1.清骨散证的热型是 答案：C</p>
      <p>2.清营汤证的热型是 答案：D</p>
    </div>
    <div v-if="tableData.name === 'A4题型'">
      <p>示例：</p>
      <p>18岁女性，2年来觉下前牙咬东西，近期牙齿感觉松动。检查下前牙松动1度。牙龈红肿，有牙石，其他牙龈微肿。</p>
      <p>1.采集病史重点了解</p>
      <p>A.有无外伤史</p>
      <p>B.家族史</p>
      <p>C.不良习惯</p>
      <p>D.口腔卫生习惯</p>
      <p>E.有无服药史</p>
      <p>2.重点检查项目是</p>
      <p>A.牙髓活力</p>
      <p>B.X线片</p>
      <p>C.松动度</p>
      <p>D.外周血象</p>
      <p>E.牙周附着丧失水平</p>
      <p>3.根据上述检查初步印象为牙周炎，有助于进一步确定诊断的检查是</p>
      <p>A.全身头颅X线</p>
      <p>B.饮下菌斑细菌检查</p>
      <p>C.局部组织病理检查</p>
      <p>D.药物过敏试验</p>
      <p>E.内分泌检查</p>
    </div>
    <div v-if="tableData.name === 'A3题型'">
      <p>患者，男，35岁。有与肺痨病人接触史。近日干咳少痰，咳声短促，痰中带血，午后自觉手足心热，或见少量盗汗，皮肤干灼，口干咽燥，舌红少苔，脉细数。</p>
      <p>1.根据患者症状此病辨证为</p>
      <p>A.肺阴亏损证</p>
      <p>B.虚火灼肺证</p>
      <p>C.气阴耗伤证</p>
      <p>D.阴阳两虚证</p>
      <p>E.肺气虚耗证</p>
      <p>2.治疗时采用的治法为</p>
      <p>A.清热养血</p>
      <p>B.滋阴降火</p>
      <p>C.益气养阴</p>
      <p>D.滋阴补阳</p>
      <p>E.滋阴润肺</p>
      <p>3.治疗采用的代表方为</p>
      <p>A.百合固金汤</p>
      <p>B.月华丸</p>
      <p>C.参苓白术散</p>
      <p>D.保真汤</p>
      <p>E.补天大造丸</p>
      <p>（1～3题）</p>
      <p>正确答案：A、E、B</p>
    </div>
    <div v-if="tableData.name === 'A2题型'">
      <p>患者下痢不止，色暗不鲜，便脓血，赤白相兼，里急后重，日久不愈。腹痛喜温，小便短赤，舌苔淡白，脉沉迟。治疗应首选的方剂是 答案：C</p>
      <p>A.白头翁汤</p>
      <p>B.木香槟榔丸</p>
      <p>C.桃花汤</p>
      <p>D.四神丸</p>
      <p>E.真人养脏汤</p>
    </div>
    <div v-if="tableData.name === 'A1题型'">
      <p>示例：治疗下痢，属“通因通用”法的方剂是 答案：D</p>
      <p>A.葛根黄芩黄连汤</p>
      <p>B.大承气汤</p>
      <p>C.白头翁汤</p>
      <p>D.芍药汤</p>
      <p>E.黄连解毒汤</p>
    </div>
  </div>
</template>
<script>
import api from './api'
export default {
  props: {
    operailityData: {
      type: Object, // 类型
      default: null // 默认值
    }},
  data () {
    return {
      api,
      tableData: []
    }
  },
  created () {
    this.init()
  },
  methods: {
    // 初始化请求列表数据
    init () {
      // ajax请求参数设置
      this.ajax({
        ajaxSuccess: 'updateListData',
        ajaxParams: {
          url: api.examTmType.path + this.operailityData.id,
          method: 'get'
        }
      })
    },
    updateListData (res) {
      let data = res.data
      this.tableData = data
      console.log(data)
    }
  }
}
</script>
<style scoped>

</style>
